In [65]:
from collections import Counter
import numpy as np
import pandas as pd

In [1]:
def mean(x):
    return sum(x)/len(x)

In [4]:
nums=list(range(11))

In [5]:
mean(nums)

5.0

In [20]:
li=[1,2,4,3,1,2,4,2,2,2,4,5,6,1,5]

In [21]:
c=Counter(li)

In [19]:
c

Counter({2: 5, 1: 3, 4: 3, 5: 2, 3: 1, 6: 1})

In [22]:
l=len(nums)

In [37]:
(l//2)+1

6

In [39]:
l2=list(range(10))

In [41]:
len(l2)//2

5

In [64]:
for _ in range(5):
    print(np.random.choice(nums,size=1000,replace=False))

ValueError: Cannot take a larger sample than population when 'replace=False'

In [61]:
nums

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [66]:
df=pd.read_csv('house_prices.csv')

In [72]:
df.head()

   house_id neighborhood  area  bedrooms  bathrooms      style    price
0      1112            B  1188         3          2      ranch   598291
1       491            B  3512         5          3  victorian  1744259
2      5952            B  1134         3          2      ranch   571669
3      3525            A  1940         4          2      ranch   493675
4      5108            B  2208         6          4  victorian  1101539

In [76]:
df['price'].mean()

np.float64(754207.8838752488)

In [79]:
df['price'].median()

np.float64(635759.0)

In [80]:
df['bathrooms'].mode()

0    2
Name: bathrooms, dtype: int64

In [81]:
df['price'].mode()

0    293703
1    457219
2    652028
3    780208
Name: price, dtype: int64

In [84]:
df['price'].std()

np.float64(523673.0609621501)

In [96]:
df['bedrooms'].value_counts()/df.shape[0]

bedrooms
4    0.226775
3    0.191772
5    0.187459
2    0.139847
6    0.118779
1    0.061214
0    0.040644
7    0.023723
8    0.009788
Name: count, dtype: float64

In [100]:
df.shape

(6028, 7)

In [90]:
df.iloc[0]

house_id          1112
neighborhood         B
area              1188
bedrooms             3
bathrooms            2
style            ranch
price           598291
Name: 0, dtype: object

In [111]:
def outliers(x):
    q1=x.quantile(.25)
    q3=x.quantile(.75)
    iqr=q3-q1
    upper_fence= q3+1.5*iqr
    lower_fence=q1-1.5*iqr
    # for i in x:
    #     if i>upper_fence:
    #         print('outlier')
    #     elif i<lower_fence:
    #         print('outlier')
    print(q1)

In [112]:
outliers(df['price'])

364135.0

In [145]:
df=pd.read_csv('house_prices.csv')
df.head()

   house_id neighborhood  area  bedrooms  bathrooms      style    price
0      1112            B  1188         3          2      ranch   598291
1       491            B  3512         5          3  victorian  1744259
2      5952            B  1134         3          2      ranch   571669
3      3525            A  1940         4          2      ranch   493675
4      5108            B  2208         6          4  victorian  1101539

In [146]:
df.drop(columns=['house_id'],inplace=True)

In [138]:
# df['neighborhood']='nh'

In [132]:
df=df[['price','area','bedrooms','bathrooms']]

In [147]:
df.head()

  neighborhood  area  bedrooms  bathrooms      style    price
0            B  1188         3          2      ranch   598291
1            B  3512         5          3  victorian  1744259
2            B  1134         3          2      ranch   571669
3            A  1940         4          2      ranch   493675
4            B  2208         6          4  victorian  1101539

In [149]:
df.rename(columns={'neighborhood':'nh'},inplace=True)

In [150]:
df.head()

  nh  area  bedrooms  bathrooms      style    price
0  B  1188         3          2      ranch   598291
1  B  3512         5          3  victorian  1744259
2  B  1134         3          2      ranch   571669
3  A  1940         4          2      ranch   493675
4  B  2208         6          4  victorian  1101539

In [156]:
# df['nh'].replace({'A':0,'B':1,'C':2,'D':3})
df['nh'].replace({i:x for x,i in enumerate(df['nh'].unique())})

C:\Users\Mohammed\AppData\Local\Temp\ipykernel_15056\553544449.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['nh'].replace({'A':0,'B':1,'C':2,'D':3})

0       1
1       1
2       1
3       0
4       1
       ..
6023    1
6024    2
6025    1
6026    2
6027    2
Name: nh, Length: 6028, dtype: int64

In [158]:
df['nc']=1

In [162]:
df['nc']=df['nc']*2

In [163]:
df.head()

  nh  area  bedrooms  bathrooms      style    price  nc
0  B  1188         3          2      ranch   598291   2
1  B  3512         5          3  victorian  1744259   2
2  B  1134         3          2      ranch   571669   2
3  A  1940         4          2      ranch   493675   2
4  B  2208         6          4  victorian  1101539   2

In [169]:
def pr(x):
    return x+x

In [174]:
df['nc1']=df['style'].apply(lambda x: x+x)

In [175]:
df.head()

  nh  area  bedrooms  bathrooms style    price  nc     nc1
0  B  1188         3          2   ran   598291   2  ranran
1  B  3512         5          3   vic  1744259   2  vicvic
2  B  1134         3          2   ran   571669   2  ranran
3  A  1940         4          2   ran   493675   2  ranran
4  B  2208         6          4   vic  1101539   2  vicvic

In [176]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6028 entries, 0 to 6027
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nh         6028 non-null   object
 1   area       6028 non-null   int64
 2   bedrooms   6028 non-null   int64
 3   bathrooms  6028 non-null   int64
 4   style      6028 non-null   object
 5   price      6028 non-null   int64
 6   nc         6028 non-null   int64
 7   nc1        6028 non-null   object
dtypes: int64(5), object(3)
memory usage: 376.9+ KB

In [178]:
df['nh']=df['nh'].astype('category')

In [180]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6028 entries, 0 to 6027
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nh         6028 non-null   category
 1   area       6028 non-null   int64
 2   bedrooms   6028 non-null   int64
 3   bathrooms  6028 non-null   int64
 4   style      6028 non-null   object
 5   price      6028 non-null   int64
 6   nc         6028 non-null   int64
 7   nc1        6028 non-null   object
dtypes: category(1), int64(5), object(2)
memory usage: 335.8+ KB

In [181]:
df.head()

  nh  area  bedrooms  bathrooms style    price  nc     nc1
0  B  1188         3          2   ran   598291   2  ranran
1  B  3512         5          3   vic  1744259   2  vicvic
2  B  1134         3          2   ran   571669   2  ranran
3  A  1940         4          2   ran   493675   2  ranran
4  B  2208         6          4   vic  1101539   2  vicvic